# Problem no 2

In [1]:
import pandas as pd

In [2]:
pr=pd.DataFrame([[1,'pencil',10],[2,'Notebook',50],[3,'Eraser',5],[4,'Pen',20]],columns=['pro_id','pro_name','Price'])

In [3]:
pr

   pro_id  pro_name  Price
0       1    pencil     10
1       2  Notebook     50
2       3    Eraser      5
3       4       Pen     20

In [4]:
pr.to_csv('products.csv',index=False)

In [5]:
pr

   pro_id  pro_name  Price
0       1    pencil     10
1       2  Notebook     50
2       3    Eraser      5
3       4       Pen     20

In [19]:
value=pr[pr['pro_id']==3][['pro_name','Price']]

In [20]:
value

  pro_name  Price
2   Eraser      5

In [29]:
pr.loc[(pr['pro_id']==3)]

   pro_id pro_name  Price
2       3   Eraser      5

# Problem no 3

In [23]:
pop={'City':['odisha','delhi','mumbai','kolkata','pune','kerla'],
    'population':[122,233,344,455,566,677]
    }
pop=pd.DataFrame(pop)
print(pop)

      City  population
0   odisha         122
1    delhi         233
2   mumbai         344
3  kolkata         455
4     pune         566
5    kerla         677

In [24]:
pop

      City  population
0   odisha         122
1    delhi         233
2   mumbai         344
3  kolkata         455
4     pune         566
5    kerla         677

In [25]:
pop['new_population']=pop['population']*2

In [26]:
pop

      City  population  new_population
0   odisha         122             244
1    delhi         233             466
2   mumbai         344             688
3  kolkata         455             910
4     pune         566            1132
5    kerla         677            1354